package main

type Request interface {
    // Връща идентификатор за заявката. Ако две заявки имат еднакви идентификатори
    // то те са "равни".
    ID() string

    // Блокира докато изпълнява заявката.
    // Връща резултата или грешка ако изпълнението е неуспешно.
    // Резултата и грешката не трябва да бъдат подавани на SetResult
    // за текущата заявка - те се запазват вътрешно преди да бъдат върнати.
    Run() (result interface{}, err error)

    // Връща дали заявката е кешируерма.
    // Метода има неопределено поведение, ако бъде извикан преди `Run`.
    Cacheable() bool

    // Задава резултата на заявката.
    // Не трябва да се извиква за заявки, за които е бил извикан `Run`.
    SetResult(result interface{}, err error)
}
