package main

type Requester interface {
    // Добавя заявка за изпълнение и я изпълнява, ако това е необходимо, при първа възможност.
    AddRequest(request Request)

    // Спира 'Заявчика'. Това означава, че изчаква всички вече започнали заявки да завършат
    // и извиква `SetResult` на тези заявки, които вече са били добавени, но "равни" на тях вече са били изпълнявание.
    // Нови заявки не трябва да бъдат започвани през това време, нито вече започнати, равни на тях, да бъдат добавяни за извикване на `SetResult`.
    Stop()
}
